app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-09-08 18:33:06.548856"], ["updated_at", "2021-09-08 18:33:06.548856"]]
---
  def create

    @article = Article.new
    #binding.pry
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_article!
    @article = Article.find(params[:id])